
[net]
width=416
height=416
channels=3
nc=1
depth_multiple=1.33
width_multiple=1.25
anchors=10, 13, 16, 30, 33, 23, 30, 61, 62, 45, 59, 119, 116, 90, 156, 198, 373, 326

[convolutional]
from=-1
number=1
args=64, 6, 2, 2

[convolutional]
from=-1
number=1
args=128, 3, 2

[C3]
from=-1
number=3
args=128

[convolutional]
from=-1
number=1
args=256, 3, 2

[C3]
from=-1
number=6
args=256

[convolutional]
from=-1
number=1
args=512, 3, 2

[C3]
from=-1
number=9
args=512

[convolutional]
from=-1
number=1
args=1024, 3, 2

[C3]
from=-1
number=3
args=1024

[SPPF]
from=-1
number=1
args=1024, 5

[convolutional]
from=-1
number=1
args=512, 1, 1

[nn.Upsample]
from=-1
number=1
args='None', 2, 'nearest'

[Concat]
from=-1, 6
number=1
args=1

[C3]
from=-1
number=3
args=512, False

[convolutional]
from=-1
number=1
args=256, 1, 1

[nn.Upsample]
from=-1
number=1
args='None', 2, 'nearest'

[Concat]
from=-1, 4
number=1
args=1

[C3]
from=-1
number=3
args=256, False

[convolutional]
from=-1
number=1
args=256, 3, 2

[Concat]
from=-1, 14
number=1
args=1

[C3]
from=-1
number=3
args=512, False

[convolutional]
from=-1
number=1
args=512, 3, 2

[Concat]
from=-1, 10
number=1
args=1

[C3]
from=-1
number=3
args=1024, False

[Detect]
from=17, 20, 23
number=1
args='nc', 'anchors'
